{
  "usuario@askfile.com": {
    "20250813_416b9a26": {
      "original_name": "historico_2021052405 (9).pdf",
      "file_path": "user_files\\20250813_416b9a26_historico_2021052405 (9).pdf",
      "summary": "Resumo:\n\nO documento é um histórico escolar emitido pela Pró-Reitoria de Ensino da Universidade Federal do Maranhão (UFMA), datado de 13 de agosto de 2025. O propósito principal é apresentar a trajetória acadêmica de Hissa Barbara Oliveira, estudante de Ciência e Tecnologia, bacharelado em Ciência e Tecnologia, com matrícula 2021052405.\n\nO documento apresenta informações sobre o curso, incluindo dados pessoais, histórico de componentes curriculares cursados e cursando, notas e situações (aprovado, reprovado, cancelado, etc.). Além disso, destaca-se a falta de habilidade do estudante para realizar o ENADE, em razão da natureza do curso. Outros pontos importantes incluem a aprovação em vários componentes curriculares, como Física Experimental, Química Geral e Inorgânica, e a reprovação em alguns componentes, como Mecânica dos Sólidos e Eletricidade Aplicada.\n\nEm resumo, o documento é um histórico escolar que apresenta a trajetória acadêmica de Hissa Barbara Oliveira, estudante de Ciência e Tecnologia na UFMA. O documento destaca a aprovação em vários componentes curriculares e a reprovação em alguns, além da falta de habilidade para realizar o ENADE.",
      "upload_date": "2025-08-13T23:41:36.033616",
      "file_size": 33700,
      "chunks_count": 200,
      "processing_result": {
        "success": true,
        "total_chunks": 200,
        "vectors_inserted": 0
      }
    },
    "20250813_c84d07da": {
      "original_name": "TCC AMANDA CARVALHO DE SOUZA.pdf",
      "file_path": "user_files\\20250813_c84d07da_TCC AMANDA CARVALHO DE SOUZA.pdf",
      "summary": "O documento é uma monografia apresentada ao Curso de Engenharia de Software do Centro Universitário Unidade de Ensino Superior Dom Bosco, com o título \"Tecnologias educacionais para autistas: explorando ferramentas tecnológicas para apoiar o desenvolvimento social e comportamental\".\n\nA monografia explora a análise de aplicativos educacionais voltados para pessoas com Transtorno do Espectro Autista (TEA), investigando seus requisitos técnicos e potenciais melhorias. A pesquisa analisou três aplicativos principais, avaliando aspectos como funcionalidade, usabilidade, acessibilidade e adaptabilidade. Os resultados indicam que, embora esses aplicativos sejam eficazes na criação de rotinas estruturadas e no apoio ao desenvolvimento de habilidades de linguagem e cognição, há uma escassez significativa de recursos em português.\n\nA conclusão do estudo é que é necessário maior investimento na adaptação cultural e linguística desses aplicativos para melhor atender às necessidades dos usuários lusófonos, promovendo uma educação mais inclusiva e eficaz.",
      "upload_date": "2025-08-13T23:45:25.041197",
      "file_size": 1612915,
      "chunks_count": 200,
      "processing_result": {
        "success": true,
        "total_chunks": 200,
        "vectors_inserted": 0
      }
    },
    "20250814_1a0df398": {
      "original_name": "TCC AMANDA CARVALHO DE SOUZA.pdf",
      "file_path": "user_files\\20250814_1a0df398_TCC AMANDA CARVALHO DE SOUZA.pdf",
      "summary": "Resumo:\n\nO presente documento é uma monografia de conclusão de curso, intitulada \"Tecnologias educacionais para autistas: explorando ferramentas tecnológicas para apoiar o desenvolvimento social e comportamental\", apresentada ao Curso de Engenharia de Software do Centro Universitário Unidade de Ensino Superior Dom Bosco.\n\nA monografia aborda a análise de aplicativos educacionais voltados para pessoas com Transtorno do Espectro Autista (TEA), buscando investigar seus requisitos técnicos e potenciais melhorias. Os principais tópicos abordados incluem a importância das intervenções tecnológicas na educação especial, as necessidades específicas das crianças com TEA e a avaliação de três aplicativos principais: FunRoutine, Matraquinha e MITA.\n\nOs resultados da pesquisa indicam que, embora os aplicativos sejam eficazes na criação de rotinas estruturadas e no apoio ao desenvolvimento de habilidades de linguagem e cognição, há uma escassez significativa de recursos em português. A conclusão do estudo é que é necessário maior investimento na adaptação cultural e linguística desses aplicativos para melhor atender às necessidades dos usuários lusófonos, promovendo uma educação mais inclusiva e eficaz.",
      "upload_date": "2025-08-14T01:21:27.662419",
      "file_size": 1612915,
      "chunks_count": 100,
      "text_length": 47709
    },
    "20250814_b90b186b": {
      "original_name": "TCC AMANDA CARVALHO DE SOUZA.pdf",
      "file_path": "user_files\\20250814_b90b186b_TCC AMANDA CARVALHO DE SOUZA.pdf",
      "summary": "Resumo:\n\nO presente documento é uma monografia de conclusão de curso de Engenharia de Software, intitulada \"Tecnologias educacionais para autistas: explorando ferramentas tecnológicas para apoiar o desenvolvimento social e comportamental\". O objetivo do trabalho é analisar aplicativos educacionais voltados para pessoas com Transtorno do Espectro Autista (TEA), investigando seus requisitos técnicos e potenciais melhorias.\n\nOs principais tópicos abordados incluem a análise de três aplicativos principais - FunRoutine, Matraquinha e MITA - avaliando aspectos como funcionalidade, usabilidade, acessibilidade e adaptabilidade. Além disso, o trabalho discute as necessidades específicas das crianças com TEA e a importância das intervenções tecnológicas na educação especial.\n\nOs resultados do estudo indicam que, embora os aplicativos sejam eficazes na criação de rotinas estruturadas e no apoio ao desenvolvimento de habilidades de linguagem e cognição, há uma escassez significativa de recursos em português. Conclui-se que é necessário maior investimento na adaptação cultural e linguística desses aplicativos para melhor atender às necessidades dos usuários lusófonos, promovendo uma educação mais inclusiva e eficaz.",
      "upload_date": "2025-08-14T01:59:55.948414",
      "file_size": 1612915,
      "chunks_count": 100,
      "text_length": 47709
    },
    "20250814_daac24a0": {
      "original_name": "TCC-EMILLY REIS.pdf",
      "file_path": null,
      "summary": "Resumo:\n\nO documento é uma monografia apresentada ao Curso de Bacharelado Interdisciplinar em Ciência e Tecnologia da Universidade Federal do Maranhão, com o objetivo de avaliar a frequência de anomalias nucleares em tubarões lixa (Ginglymostoma cirratum) capturados na Costa Amazônica Brasileira.\n\nA monografia é composta por várias seções, incluindo a introdução, metodologia, resultados e discussão. A seção de resultados apresenta os dados coletados em 14 indivíduos adultos e 11 embriões de tubarões lixa, analisados para detectar anomalias nucleares, como micronúcleos, brotamento nuclear e núcleos bilobados. Os resultados mostraram uma frequência inferior a 5% de anomalias nucleares, sem diferenças estatisticamente significantes entre os grupos etários.\n\nOs principais dados importantes incluem a frequência de anomalias nucleares, a presença de mecanismos de reparo genético eficientes e a baixa expressão de danos genotóxicos. A discussão destaca a importância dos biomarcadores celulares no monitoramento ambiental e a limitação da espécie G. cirratum como bioindicadora da poluição costeira.\n\nEm resumo, a monografia apresenta um estudo sobre a frequência de anomalias nucleares em tubarões lixa, com resultados que sugerem a presença de mecanismos de reparo genético eficientes e a baixa expressão de danos genotóxicos.",
      "upload_date": "2025-08-14T02:39:43.141340",
      "file_size": 2212402,
      "chunks_count": 53,
      "text_length": 36879,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 26,
        "avg_chunk_size": 764,
        "min_chunk_size": 162,
        "max_chunk_size": 998
      }
    },
    "20250814_ca8f6659": {
      "original_name": "TCC-EMILLY REIS.pdf",
      "file_path": null,
      "summary": "Resumo:\n\nO documento é uma monografia de conclusão de curso de bacharelado em Ciência e Tecnologia, intitulada \"Frequência de anomalias nucleares em tubarões lixa da Costa Amazônica Brasileira\". O objetivo principal do estudo é avaliar a frequência de anomalias nucleares em brânquias de tubarões lixa capturados na Costa Amazônica Brasileira, como indicativo de possíveis efeitos genotóxicos.\n\nA monografia é composta por várias seções, incluindo uma introdução, uma seção de resultados e uma seção de discussão. Os resultados mostram que a frequência de anomalias nucleares é inferior a 5% e não há diferenças estatisticamente significantes entre os grupos etários. Além disso, os dados sugerem a presença de mecanismos celulares de reparo genético eficientes, que podem contribuir para a baixa expressão de danos genotóxicos.\n\nOs principais dados importantes incluem a análise de 14 indivíduos adultos e 11 embriões de tubarões lixa, coletados na região do Canal do Navio, baía de São Marcos, Maranhão. A contagem de células foi realizada em 1.000 células por indivíduo. A frequência de anomalias nucleares foi avaliada em relação a micronúcleos, brotamento nuclear e núcleos bilobados.\n\nEm resumo, a monografia apresenta um estudo que avalia a frequência de anomalias nucleares em tubarões lixa da Costa Amazônica Brasileira e sugere a presença de mecanismos celulares de reparo genético eficientes. Os resultados podem ser úteis para consultas futuras sobre a genotoxicidade e a fisiologia de Ginglymostoma cirratum, bem como para a monitoração ambiental e a avaliação da poluição costeira.",
      "upload_date": "2025-08-14T02:47:28.538097",
      "file_size": 2212402,
      "chunks_count": 53,
      "text_length": 36879,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 26,
        "avg_chunk_size": 764,
        "min_chunk_size": 162,
        "max_chunk_size": 998
      }
    },
    "20250814_51c8ce9a": {
      "original_name": "TCC-EMILLY REIS.pdf",
      "file_path": null,
      "summary": "Resumo:\n\nO documento é uma monografia de conclusão de curso de bacharelado em Ciência e Tecnologia, apresentada por Emilly Vitória Ferreira Reis, com o título \"Frequência de anomalias nucleares em tubarões lixa da Costa Amazônica Brasileira\". O objetivo principal do estudo é avaliar a frequência de anomalias nucleares (micronúcleo, brotamento nuclear e núcleo bilobado) em brânquias de tubarões lixa capturados na Costa Amazônica Brasileira, como indicativo de possíveis efeitos genotóxicos.\n\nA monografia é composta por várias seções, incluindo uma introdução, uma seção de métodos, resultados e discussão, e uma seção de conclusões. Os principais tópicos abordados incluem a importância da espécie Ginglymostoma cirratum como bioindicadora da poluição costeira, a frequência de anomalias nucleares em brânquias de tubarões lixa e a presença de mecanismos celulares de reparo genético eficientes.\n\nOs dados importantes incluem a frequência inferior a 5% de anomalias nucleares em brânquias de tubarões lixa, sem diferença estatística significativa entre os grupos etários. Além disso, a monografia destaca a importância dos biomarcadores celulares no monitoramento ambiental e a necessidade de estudos futuros para melhor compreender a fisiologia da espécie G. cirratum e suas limitações como bioindicadora da poluição costeira.\n\nEm resumo, a monografia apresenta um estudo que avalia a frequência de anomalias nucleares em brânquias de tubarões lixa da Costa Amazônica Brasileira e destaca a importância da espécie como bioindicadora da poluição costeira. Os resultados sugerem a presença de mecanismos celulares de reparo genético eficientes e a necessidade de estudos futuros para melhor compreender a fisiologia da espécie e suas limitações como bioindicadora.",
      "upload_date": "2025-08-14T03:07:59.140718",
      "file_size": 2212402,
      "chunks_count": 53,
      "text_length": 36879,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 26,
        "avg_chunk_size": 764,
        "min_chunk_size": 162,
        "max_chunk_size": 998
      }
    },
    "20250814_67109ba5": {
      "original_name": "historico_2021052405 (9).pdf",
      "file_path": null,
      "summary": "Resumo:\n\nO documento é um histórico escolar emitido pela Pró-Reitoria de Ensino (PROEN) da Universidade Federal do Maranhão (UFMA), datado de 13 de agosto de 2025. O objetivo principal do documento é fornecer informações sobre o histórico acadêmico de Hissa Barbara Oliveira, estudante do curso de Ciência e Tecnologia - Bacharelado em Ciência e Tecnologia, com matrícula 2021052405.\n\nO documento é composto por várias seções, incluindo dados pessoais, informações sobre o curso, componentes curriculares cursados e cursando, e histórico de aprovação e reprovação em cada componente curricular. Os principais tópicos abordados incluem a lista de componentes curriculares cursados e cursando, com informações sobre a turma, situação, frequência, nota e data de aprovação ou reprovação.\n\nOs dados importantes incluem a lista de componentes curriculares cursados e cursando, com informações sobre a turma, situação, frequência, nota e data de aprovação ou reprovação. Além disso, o documento destaca a aprovação de Hissa Barbara Oliveira em vários componentes curriculares, incluindo Ciência, Tecnologia e Sociedade, Desenho Computacional, Química Geral e Inorgânica, e Física Experimental II, entre outros. No entanto, também há componentes curriculares que foram reprovidos, como Química Experimental e Equações Diferenciais I.\n\nEm resumo, o documento é um histórico escolar importante para Hissa Barbara Oliveira, estudante da UFMA, que destaca sua progressão acadêmica e aprovação em vários componentes curriculares. O documento pode ser útil para consultas futuras, fornecendo informações importantes sobre o histórico acadêmico da estudante.",
      "upload_date": "2025-08-14T03:25:31.422837",
      "file_size": 33700,
      "chunks_count": 13,
      "text_length": 10129,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 3,
        "avg_chunk_size": 889,
        "min_chunk_size": 425,
        "max_chunk_size": 984
      }
    }
  }
}