{
  "usuario@askfile.com": {
    "20250813_416b9a26": {
      "original_name": "historico_2021052405 (9).pdf",
      "file_path": "user_files\\20250813_416b9a26_historico_2021052405 (9).pdf",
      "summary": "Resumo:\n\nO documento é um histórico escolar emitido pela Pró-Reitoria de Ensino da Universidade Federal do Maranhão (UFMA), datado de 13 de agosto de 2025. O propósito principal é apresentar a trajetória acadêmica de Hissa Barbara Oliveira, estudante de Ciência e Tecnologia, bacharelado em Ciência e Tecnologia, com matrícula 2021052405.\n\nO documento apresenta informações sobre o curso, incluindo dados pessoais, histórico de componentes curriculares cursados e cursando, notas e situações (aprovado, reprovado, cancelado, etc.). Além disso, destaca-se a falta de habilidade do estudante para realizar o ENADE, em razão da natureza do curso. Outros pontos importantes incluem a aprovação em vários componentes curriculares, como Física Experimental, Química Geral e Inorgânica, e a reprovação em alguns componentes, como Mecânica dos Sólidos e Eletricidade Aplicada.\n\nEm resumo, o documento é um histórico escolar que apresenta a trajetória acadêmica de Hissa Barbara Oliveira, estudante de Ciência e Tecnologia na UFMA. O documento destaca a aprovação em vários componentes curriculares e a reprovação em alguns, além da falta de habilidade para realizar o ENADE.",
      "upload_date": "2025-08-13T23:41:36.033616",
      "file_size": 33700,
      "chunks_count": 200,
      "processing_result": {
        "success": true,
        "total_chunks": 200,
        "vectors_inserted": 0
      }
    },
    "20250813_c84d07da": {
      "original_name": "TCC AMANDA CARVALHO DE SOUZA.pdf",
      "file_path": "user_files\\20250813_c84d07da_TCC AMANDA CARVALHO DE SOUZA.pdf",
      "summary": "O documento é uma monografia apresentada ao Curso de Engenharia de Software do Centro Universitário Unidade de Ensino Superior Dom Bosco, com o título \"Tecnologias educacionais para autistas: explorando ferramentas tecnológicas para apoiar o desenvolvimento social e comportamental\".\n\nA monografia explora a análise de aplicativos educacionais voltados para pessoas com Transtorno do Espectro Autista (TEA), investigando seus requisitos técnicos e potenciais melhorias. A pesquisa analisou três aplicativos principais, avaliando aspectos como funcionalidade, usabilidade, acessibilidade e adaptabilidade. Os resultados indicam que, embora esses aplicativos sejam eficazes na criação de rotinas estruturadas e no apoio ao desenvolvimento de habilidades de linguagem e cognição, há uma escassez significativa de recursos em português.\n\nA conclusão do estudo é que é necessário maior investimento na adaptação cultural e linguística desses aplicativos para melhor atender às necessidades dos usuários lusófonos, promovendo uma educação mais inclusiva e eficaz.",
      "upload_date": "2025-08-13T23:45:25.041197",
      "file_size": 1612915,
      "chunks_count": 200,
      "processing_result": {
        "success": true,
        "total_chunks": 200,
        "vectors_inserted": 0
      }
    },
    "20250814_1a0df398": {
      "original_name": "TCC AMANDA CARVALHO DE SOUZA.pdf",
      "file_path": "user_files\\20250814_1a0df398_TCC AMANDA CARVALHO DE SOUZA.pdf",
      "summary": "Resumo:\n\nO presente documento é uma monografia de conclusão de curso, intitulada \"Tecnologias educacionais para autistas: explorando ferramentas tecnológicas para apoiar o desenvolvimento social e comportamental\", apresentada ao Curso de Engenharia de Software do Centro Universitário Unidade de Ensino Superior Dom Bosco.\n\nA monografia aborda a análise de aplicativos educacionais voltados para pessoas com Transtorno do Espectro Autista (TEA), buscando investigar seus requisitos técnicos e potenciais melhorias. Os principais tópicos abordados incluem a importância das intervenções tecnológicas na educação especial, as necessidades específicas das crianças com TEA e a avaliação de três aplicativos principais: FunRoutine, Matraquinha e MITA.\n\nOs resultados da pesquisa indicam que, embora os aplicativos sejam eficazes na criação de rotinas estruturadas e no apoio ao desenvolvimento de habilidades de linguagem e cognição, há uma escassez significativa de recursos em português. A conclusão do estudo é que é necessário maior investimento na adaptação cultural e linguística desses aplicativos para melhor atender às necessidades dos usuários lusófonos, promovendo uma educação mais inclusiva e eficaz.",
      "upload_date": "2025-08-14T01:21:27.662419",
      "file_size": 1612915,
      "chunks_count": 100,
      "text_length": 47709
    },
    "20250814_b90b186b": {
      "original_name": "TCC AMANDA CARVALHO DE SOUZA.pdf",
      "file_path": "user_files\\20250814_b90b186b_TCC AMANDA CARVALHO DE SOUZA.pdf",
      "summary": "Resumo:\n\nO presente documento é uma monografia de conclusão de curso de Engenharia de Software, intitulada \"Tecnologias educacionais para autistas: explorando ferramentas tecnológicas para apoiar o desenvolvimento social e comportamental\". O objetivo do trabalho é analisar aplicativos educacionais voltados para pessoas com Transtorno do Espectro Autista (TEA), investigando seus requisitos técnicos e potenciais melhorias.\n\nOs principais tópicos abordados incluem a análise de três aplicativos principais - FunRoutine, Matraquinha e MITA - avaliando aspectos como funcionalidade, usabilidade, acessibilidade e adaptabilidade. Além disso, o trabalho discute as necessidades específicas das crianças com TEA e a importância das intervenções tecnológicas na educação especial.\n\nOs resultados do estudo indicam que, embora os aplicativos sejam eficazes na criação de rotinas estruturadas e no apoio ao desenvolvimento de habilidades de linguagem e cognição, há uma escassez significativa de recursos em português. Conclui-se que é necessário maior investimento na adaptação cultural e linguística desses aplicativos para melhor atender às necessidades dos usuários lusófonos, promovendo uma educação mais inclusiva e eficaz.",
      "upload_date": "2025-08-14T01:59:55.948414",
      "file_size": 1612915,
      "chunks_count": 100,
      "text_length": 47709
    },
    "20250814_daac24a0": {
      "original_name": "TCC-EMILLY REIS.pdf",
      "file_path": null,
      "summary": "Resumo:\n\nO documento é uma monografia apresentada ao Curso de Bacharelado Interdisciplinar em Ciência e Tecnologia da Universidade Federal do Maranhão, com o objetivo de avaliar a frequência de anomalias nucleares em tubarões lixa (Ginglymostoma cirratum) capturados na Costa Amazônica Brasileira.\n\nA monografia é composta por várias seções, incluindo a introdução, metodologia, resultados e discussão. A seção de resultados apresenta os dados coletados em 14 indivíduos adultos e 11 embriões de tubarões lixa, analisados para detectar anomalias nucleares, como micronúcleos, brotamento nuclear e núcleos bilobados. Os resultados mostraram uma frequência inferior a 5% de anomalias nucleares, sem diferenças estatisticamente significantes entre os grupos etários.\n\nOs principais dados importantes incluem a frequência de anomalias nucleares, a presença de mecanismos de reparo genético eficientes e a baixa expressão de danos genotóxicos. A discussão destaca a importância dos biomarcadores celulares no monitoramento ambiental e a limitação da espécie G. cirratum como bioindicadora da poluição costeira.\n\nEm resumo, a monografia apresenta um estudo sobre a frequência de anomalias nucleares em tubarões lixa, com resultados que sugerem a presença de mecanismos de reparo genético eficientes e a baixa expressão de danos genotóxicos.",
      "upload_date": "2025-08-14T02:39:43.141340",
      "file_size": 2212402,
      "chunks_count": 53,
      "text_length": 36879,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 26,
        "avg_chunk_size": 764,
        "min_chunk_size": 162,
        "max_chunk_size": 998
      }
    },
    "20250814_ca8f6659": {
      "original_name": "TCC-EMILLY REIS.pdf",
      "file_path": null,
      "summary": "Resumo:\n\nO documento é uma monografia de conclusão de curso de bacharelado em Ciência e Tecnologia, intitulada \"Frequência de anomalias nucleares em tubarões lixa da Costa Amazônica Brasileira\". O objetivo principal do estudo é avaliar a frequência de anomalias nucleares em brânquias de tubarões lixa capturados na Costa Amazônica Brasileira, como indicativo de possíveis efeitos genotóxicos.\n\nA monografia é composta por várias seções, incluindo uma introdução, uma seção de resultados e uma seção de discussão. Os resultados mostram que a frequência de anomalias nucleares é inferior a 5% e não há diferenças estatisticamente significantes entre os grupos etários. Além disso, os dados sugerem a presença de mecanismos celulares de reparo genético eficientes, que podem contribuir para a baixa expressão de danos genotóxicos.\n\nOs principais dados importantes incluem a análise de 14 indivíduos adultos e 11 embriões de tubarões lixa, coletados na região do Canal do Navio, baía de São Marcos, Maranhão. A contagem de células foi realizada em 1.000 células por indivíduo. A frequência de anomalias nucleares foi avaliada em relação a micronúcleos, brotamento nuclear e núcleos bilobados.\n\nEm resumo, a monografia apresenta um estudo que avalia a frequência de anomalias nucleares em tubarões lixa da Costa Amazônica Brasileira e sugere a presença de mecanismos celulares de reparo genético eficientes. Os resultados podem ser úteis para consultas futuras sobre a genotoxicidade e a fisiologia de Ginglymostoma cirratum, bem como para a monitoração ambiental e a avaliação da poluição costeira.",
      "upload_date": "2025-08-14T02:47:28.538097",
      "file_size": 2212402,
      "chunks_count": 53,
      "text_length": 36879,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 26,
        "avg_chunk_size": 764,
        "min_chunk_size": 162,
        "max_chunk_size": 998
      }
    },
    "20250814_51c8ce9a": {
      "original_name": "TCC-EMILLY REIS.pdf",
      "file_path": null,
      "summary": "Resumo:\n\nO documento é uma monografia de conclusão de curso de bacharelado em Ciência e Tecnologia, apresentada por Emilly Vitória Ferreira Reis, com o título \"Frequência de anomalias nucleares em tubarões lixa da Costa Amazônica Brasileira\". O objetivo principal do estudo é avaliar a frequência de anomalias nucleares (micronúcleo, brotamento nuclear e núcleo bilobado) em brânquias de tubarões lixa capturados na Costa Amazônica Brasileira, como indicativo de possíveis efeitos genotóxicos.\n\nA monografia é composta por várias seções, incluindo uma introdução, uma seção de métodos, resultados e discussão, e uma seção de conclusões. Os principais tópicos abordados incluem a importância da espécie Ginglymostoma cirratum como bioindicadora da poluição costeira, a frequência de anomalias nucleares em brânquias de tubarões lixa e a presença de mecanismos celulares de reparo genético eficientes.\n\nOs dados importantes incluem a frequência inferior a 5% de anomalias nucleares em brânquias de tubarões lixa, sem diferença estatística significativa entre os grupos etários. Além disso, a monografia destaca a importância dos biomarcadores celulares no monitoramento ambiental e a necessidade de estudos futuros para melhor compreender a fisiologia da espécie G. cirratum e suas limitações como bioindicadora da poluição costeira.\n\nEm resumo, a monografia apresenta um estudo que avalia a frequência de anomalias nucleares em brânquias de tubarões lixa da Costa Amazônica Brasileira e destaca a importância da espécie como bioindicadora da poluição costeira. Os resultados sugerem a presença de mecanismos celulares de reparo genético eficientes e a necessidade de estudos futuros para melhor compreender a fisiologia da espécie e suas limitações como bioindicadora.",
      "upload_date": "2025-08-14T03:07:59.140718",
      "file_size": 2212402,
      "chunks_count": 53,
      "text_length": 36879,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 26,
        "avg_chunk_size": 764,
        "min_chunk_size": 162,
        "max_chunk_size": 998
      }
    },
    "20250814_67109ba5": {
      "original_name": "historico_2021052405 (9).pdf",
      "file_path": null,
      "summary": "Resumo:\n\nO documento é um histórico escolar emitido pela Pró-Reitoria de Ensino (PROEN) da Universidade Federal do Maranhão (UFMA), datado de 13 de agosto de 2025. O objetivo principal do documento é fornecer informações sobre o histórico acadêmico de Hissa Barbara Oliveira, estudante do curso de Ciência e Tecnologia - Bacharelado em Ciência e Tecnologia, com matrícula 2021052405.\n\nO documento é composto por várias seções, incluindo dados pessoais, informações sobre o curso, componentes curriculares cursados e cursando, e histórico de aprovação e reprovação em cada componente curricular. Os principais tópicos abordados incluem a lista de componentes curriculares cursados e cursando, com informações sobre a turma, situação, frequência, nota e data de aprovação ou reprovação.\n\nOs dados importantes incluem a lista de componentes curriculares cursados e cursando, com informações sobre a turma, situação, frequência, nota e data de aprovação ou reprovação. Além disso, o documento destaca a aprovação de Hissa Barbara Oliveira em vários componentes curriculares, incluindo Ciência, Tecnologia e Sociedade, Desenho Computacional, Química Geral e Inorgânica, e Física Experimental II, entre outros. No entanto, também há componentes curriculares que foram reprovidos, como Química Experimental e Equações Diferenciais I.\n\nEm resumo, o documento é um histórico escolar importante para Hissa Barbara Oliveira, estudante da UFMA, que destaca sua progressão acadêmica e aprovação em vários componentes curriculares. O documento pode ser útil para consultas futuras, fornecendo informações importantes sobre o histórico acadêmico da estudante.",
      "upload_date": "2025-08-14T03:25:31.422837",
      "file_size": 33700,
      "chunks_count": 13,
      "text_length": 10129,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 3,
        "avg_chunk_size": 889,
        "min_chunk_size": 425,
        "max_chunk_size": 984
      }
    },
    "20250814_2321265f": {
      "original_name": "historico_2021052405 (9).pdf",
      "file_path": null,
      "summary": "Resumo:\n\nO documento é um Histórico Escolar emitido pela Pró-Reitoria de Ensino (PROEN) da Universidade Federal do Maranhão (UFMA), com o objetivo de registrar a trajetória acadêmica de Hissa Barbara Oliveira, estudante de Ciência e Tecnologia no Bacharelado em Ciência e Tecnologia.\n\nO documento é composto por várias seções, incluindo dados pessoais, informações sobre o curso, componentes curriculares cursados e cursando, e histórico de notas e situações acadêmicas. Os principais tópicos abordados incluem a matrícula, o nome do estudante, a data de nascimento, o endereço, a nacionalidade e o CPF.\n\nOs dados importantes incluem a situação acadêmica do estudante, com informações sobre aprovação, reprovação e cancelamento de componentes curriculares. Além disso, o documento apresenta informações sobre a frequência e as notas obtidas nos componentes curriculares, bem como a data de colação de grau e o prazo máximo para conclusão do curso.\n\nEm resumo, o documento é uma ferramenta importante para a gestão acadêmica e para a verificação da autenticidade do estudante. Ele fornece informações valiosas sobre a trajetória acadêmica do estudante e pode ser útil para consultas futuras.",
      "upload_date": "2025-08-14T03:51:40.896714",
      "file_size": 33700,
      "chunks_count": 13,
      "text_length": 10129,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 3,
        "avg_chunk_size": 889,
        "min_chunk_size": 425,
        "max_chunk_size": 984
      }
    },
    "20250814_b82b87a8": {
      "original_name": "historico_2021052405 (9).pdf",
      "file_path": null,
      "summary": "Resumo:\n\nO documento é um Histórico Escolar emitido pela Pró-Reitoria de Ensino (PROEN) da Universidade Federal do Maranhão (UFMA), com o objetivo de registrar a trajetória acadêmica de Hissa Barbara Oliveira, estudante do curso de Ciência e Tecnologia - Bacharelado, com matrícula 2021052405.\n\nO documento é composto por várias seções, incluindo dados pessoais, informações sobre o curso, componentes curriculares cursados e cursando, e notas obtidas em cada disciplina. Os principais tópicos abordados incluem a descrição do curso, a lista de componentes curriculares, as notas obtidas em cada disciplina e as informações sobre o histórico de trancamentos e reconhecimento do curso.\n\nOs dados importantes incluem a data de nascimento e local de nascimento da estudante, a data de emissão do documento e o código de verificação. Além disso, o documento apresenta informações sobre as disciplinas cursadas, incluindo a nota obtida em cada uma delas, bem como informações sobre trancamentos e reconhecimento do curso.\n\nConclusões: O documento é uma ferramenta importante para a gestão acadêmica e para a verificação da autenticidade do histórico escolar da estudante. Ele fornece informações detalhadas sobre a trajetória acadêmica da estudante, incluindo as disciplinas cursadas, as notas obtidas e as informações sobre trancamentos e reconhecimento do curso.",
      "upload_date": "2025-08-14T03:54:25.654544",
      "file_size": 33700,
      "chunks_count": 13,
      "text_length": 10129,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 3,
        "avg_chunk_size": 889,
        "min_chunk_size": 425,
        "max_chunk_size": 984
      }
    },
    "20250814_db1fb6ab": {
      "original_name": "TCC AMANDA CARVALHO DE SOUZA.pdf",
      "file_path": null,
      "summary": "Resumo:\n\nO documento é uma monografia apresentada ao Curso de Engenharia de Software do Centro Universitário Unidade de Ensino Superior Dom Bosco (UNDB) como requisito parcial para obtenção do grau de Bacharel em Engenharia de Software. O objetivo principal é explorar a análise de aplicativos educacionais voltados para pessoas com Transtorno do Espectro Autista (TEA), investigando seus requisitos técnicos e potenciais melhorias.\n\nA monografia é composta por várias seções, incluindo a introdução, a revisão da literatura, a metodologia, os resultados e a discussão. A seção de resultados apresenta a análise de três aplicativos principais: FunRoutine, Matraquinha e MITA, avaliando aspectos como funcionalidade, usabilidade, acessibilidade e adaptabilidade. Os resultados indicam que, embora esses aplicativos sejam eficazes na criação de rotinas estruturadas e no apoio ao desenvolvimento de habilidades de linguagem e cognição, há uma escassez significativa de recursos em português.\n\nOs dados importantes incluem a falta de recursos em português nos aplicativos analisados e as sugestões de melhoria feitas pelos usuários, como a personalização de vozes e a inclusão de funcionalidades offline. A conclusão é que é necessário maior investimento na adaptação cultural e linguística desses aplicativos para melhor atender às necessidades dos usuários lusófonos, promovendo uma educação mais inclusiva e eficaz.\n\nEm resumo, a monografia apresenta uma análise crítica de aplicativos educacionais para pessoas com TEA, identificando suas limitações e sugerindo melhorias para melhor atender às necessidades dos usuários.",
      "upload_date": "2025-08-14T03:55:10.151331",
      "file_size": 1612915,
      "chunks_count": 117,
      "text_length": 82879,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 50,
        "avg_chunk_size": 781,
        "min_chunk_size": 113,
        "max_chunk_size": 997
      }
    },
    "20250814_a0199446": {
      "original_name": "historico_2021052405 (9).pdf",
      "file_path": null,
      "summary": "Resumo:\n\nO documento é um Histórico Escolar, emitido em 13/08/2025, que apresenta a trajetória acadêmica de Hissa Barbara Oliveira, estudante da Universidade Federal do Maranhão (UFMA). O objetivo principal do documento é fornecer informações sobre os componentes curriculares cursados e concluídos pelo estudante, bem como sua evolução acadêmica ao longo do tempo.\n\nO documento é composto por várias seções, incluindo a seção de dados pessoais, que apresenta informações sobre o estudante, como nome, data de nascimento e endereço. A seção mais importante é a de componentes curriculares, que lista todos os cursos e disciplinas cursadas pelo estudante, incluindo a nota obtida em cada uma delas. Além disso, o documento apresenta informações sobre as disciplinas canceladas ou não concluídas.\n\nOs dados importantes apresentados no documento incluem a nota média geral do estudante, que é de 7,5, e a quantidade de disciplinas cursadas e concluídas, que é de 35. Além disso, o documento destaca a evolução acadêmica do estudante ao longo do tempo, mostrando que ele tem melhorado suas notas ao longo dos anos.\n\nConclusões: O documento Histórico Escolar de Hissa Barbara Oliveira apresenta uma visão detalhada da sua trajetória acadêmica na UFMA. Ele é uma ferramenta importante para o estudante, pois permite que ele tenha acesso a informações sobre seus resultados acadêmicos e planeje sua carreira futura. Além disso, o documento pode ser útil para consultas futuras, pois apresenta informações importantes sobre a evolução acadêmica do estudante.",
      "upload_date": "2025-08-14T03:59:43.060594",
      "file_size": 33700,
      "chunks_count": 13,
      "text_length": 10129,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 3,
        "avg_chunk_size": 889,
        "min_chunk_size": 425,
        "max_chunk_size": 984
      }
    },
    "20250814_8e2c30c4": {
      "original_name": "historico_2021052405 (9).pdf",
      "file_path": null,
      "summary": "Resumo:\n\nO documento é um histórico escolar emitido pela Pró-Reitoria de Ensino (PROEN) da Universidade Federal do Maranhão (UFMA), com o objetivo de registrar a evolução acadêmica de uma estudante, Hissa Barbara Oliveira, durante seu curso de Bacharelado em Ciência e Tecnologia.\n\nO documento é composto por duas páginas e apresenta informações sobre a estudante, incluindo seus dados pessoais, endereço e nacionalidade. A seção principal do documento é a lista de componentes curriculares cursados e cursando, que incluem disciplinas como Química Geral e Inorgânica, Física Experimental, Mecânica dos Sólidos, Laboratório de Programação e Engenharia de Software, entre outras.\n\nOs dados importantes incluem a média geral da estudante, que é de 7,5, e a situação de cada disciplina cursada, com a maioria das disciplinas tendo sido aprovadas. Além disso, o documento também apresenta informações sobre as disciplinas que a estudante não cursou, como a disciplina de Funções de Várias Variáveis, que foi cancelada.\n\nEm resumo, o documento é um registro importante da evolução acadêmica da estudante Hissa Barbara Oliveira e pode ser útil para consultas futuras, como, por exemplo, para verificar a autenticidade do documento ou para obter informações sobre a estudante.",
      "upload_date": "2025-08-14T04:00:41.337867",
      "file_size": 33700,
      "chunks_count": 13,
      "text_length": 10129,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 3,
        "avg_chunk_size": 889,
        "min_chunk_size": 425,
        "max_chunk_size": 984
      }
    },
    "20250814_4ccdf5f5": {
      "original_name": "historico_2021052405 (9).pdf",
      "file_path": null,
      "summary": "Resumo:\n\nO documento é um histórico escolar emitido pela Pró-Reitoria de Ensino da Universidade Federal do Maranhão (UFMA), datado de 13 de agosto de 2025. O objetivo principal do documento é apresentar a trajetória acadêmica de Hissa Barbara Oliveira, com matrícula 2021052405, desde o início do curso de Bacharelado em Ciência e Tecnologia até a data de emissão do documento.\n\nO histórico escolar aborda os principais tópicos e seções, incluindo dados pessoais, informações sobre o curso, componentes curriculares cursados e cursando, notas e situações acadêmicas. Além disso, o documento apresenta informações sobre o reconhecimento do curso, prorrogações, período letivo atual e saída do curso.\n\nOs dados importantes incluem a nota média geral de 7,4, a situação acadêmica de \"ativo\" e a data de colação de grau prevista para 2026.1. Além disso, o documento destaca a aprovação em 14 componentes curriculares e a reprovação em 4 componentes.\n\nEm conclusão, o histórico escolar é um documento importante para a avaliação da trajetória acadêmica de Hissa Barbara Oliveira e pode ser útil para consultas futuras. O documento apresenta informações detalhadas sobre o curso, componentes curriculares e situações acadêmicas, permitindo uma visão geral da evolução acadêmica da estudante.",
      "upload_date": "2025-08-14T04:04:21.129721",
      "file_size": 33700,
      "chunks_count": 13,
      "text_length": 10129,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 3,
        "avg_chunk_size": 889,
        "min_chunk_size": 425,
        "max_chunk_size": 984
      }
    },
    "20250814_92790286": {
      "original_name": "historico_2021052405 (9).pdf",
      "file_path": null,
      "summary": "Resumo:\n\nO documento é um histórico escolar emitido pela Pró-Reitoria de Ensino (PROEN) da Universidade Federal do Maranhão (UFMA), com o objetivo de registrar os dados acadêmicos e curriculares de Hissa Barbara Oliveira, aluno do curso de Ciência e Tecnologia - Bacharelado, com matrícula 2021052405.\n\nO documento aborda os principais tópicos e seções, incluindo dados pessoais, histórico de curso, componentes curriculares cursados e cursando, notas e situações acadêmicas. Além disso, apresenta informações sobre o reconhecimento do curso, prorrogações e saída do curso.\n\nOs dados importantes incluem a data de nascimento e local de nascimento (25/04/2002, Ribeirão Pires/SP), a nacionalidade (brasileira), o CPF (614.269.603-52) e a matrícula (2021052405). Além disso, o documento destaca a situação acadêmica do aluno, com aprovações e reprovações em diferentes componentes curriculares.\n\nConclusões: O histórico escolar é um documento importante para a Universidade Federal do Maranhão, pois registra a evolução acadêmica e curricular do aluno. O documento destaca a importância da aprovação em diferentes componentes curriculares e a necessidade de atenção à situação acadêmica do aluno. Além disso, o documento pode ser útil para consultas futuras, pois fornece informações importantes sobre a evolução acadêmica do aluno.",
      "upload_date": "2025-08-14T04:05:11.819852",
      "file_size": 33700,
      "chunks_count": 13,
      "text_length": 10129,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 3,
        "avg_chunk_size": 889,
        "min_chunk_size": 425,
        "max_chunk_size": 984
      }
    },
    "20250814_650a4202": {
      "original_name": "atividades_complementares_euderlan_bict_2025.1.pdf",
      "file_path": null,
      "summary": "Resumo:\n\nO documento é um requerimento para o cadastro de atividades complementares do aluno Euderlan Freire da Silva Abreu, com matrícula 2021052460, no Bacharelado Interdisciplinar de Ciências e Tecnologia da Universidade Federal do Maranhão (UFMA). O objetivo principal é obter a validação e registro das atividades complementares especificadas na tabela anexa e comprovadas por documentos anexos.\n\nAs principais seções abordadas no documento são: Atividades de Ensino, Atividades de Pesquisa, Atividades de Extensão, Produção Técnica, Científica, de Inovação ou Artística e Projeto Integrador. Essas seções abordam diferentes tipos de atividades, como monitoria, estágio curricular, participação em projetos e eventos, publicação de artigos científicos e depósito de patente.\n\nOs dados importantes incluem a carga horária solicitada para cada atividade, a quantidade de horas trabalhadas e a comprovação dessas horas por documentos anexos. Além disso, o documento inclui informações pessoais do aluno, como nome, matrícula, endereço e dados do curso.\n\nEm conclusão, o documento é um relatório detalhado das atividades complementares do aluno Euderlan Freire da Silva Abreu, com objetivo de obter a validação e registro dessas atividades pela Coordenação da UFMA. O documento é importante para consultas futuras, pois fornece informações precisas sobre as atividades realizadas pelo aluno e sua carga horária.",
      "upload_date": "2025-08-14T04:11:30.203999",
      "file_size": 4346822,
      "chunks_count": 31,
      "text_length": 21761,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 14,
        "avg_chunk_size": 774,
        "min_chunk_size": 276,
        "max_chunk_size": 997
      }
    }
  },
  "user_1755190467501_1tu7uaiq7@askfile.com": {
    "20250815_56bbfaa3": {
      "original_name": "Codigos_fontes.pdf",
      "file_path": null,
      "summary": "**Resumo**\n\nO documento \"Codigos_fontes.pdf\" é um arquivo de diagrama de fluxo de processos (Use Case) que descreve os principais cenários e funcionalidades de um sistema de avaliação de respostas. O objetivo principal do documento é apresentar a estrutura e o funcionamento do sistema, permitindo que os desenvolvedores e stakeholders compreendam melhor as necessidades e requisitos do sistema.\n\nO documento é composto por cinco seções principais: Avaliar Resposta, Cadastro e Login, Gerenciar Resoluções, Histórico e Fazer Pergunta. Cada seção apresenta um diagrama de fluxo de processos que descreve as interações entre os usuários e o sistema, bem como as funcionalidades e requisitos do sistema.\n\nOs principais dados importantes apresentados no documento incluem a criação de contas, login, avaliação de respostas, gerenciamento de resoluções, histórico de perguntas e respostas, e processamento de perguntas. Além disso, o documento destaca a importância da validação de dados e credenciais, bem como a necessidade de atualizar a base vetorial e consultar a Linguagem de Linguagem de Linguagem (LLM).\n\nEm conclusão, o documento \"Codigos_fontes.pdf\" é uma ferramenta valiosa para os desenvolvedores e stakeholders que buscam entender melhor o funcionamento e as necessidades do sistema de avaliação de respostas. O documento apresenta uma visão clara e detalhada das funcionalidades e requisitos do sistema, permitindo que os desenvolvedores criem uma solução mais eficaz e eficiente.",
      "upload_date": "2025-08-15T20:23:53.433448",
      "file_size": 49911,
      "chunks_count": 6,
      "text_length": 1921,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 2,
        "avg_chunk_size": 687,
        "min_chunk_size": 169,
        "max_chunk_size": 991
      }
    },
    "20250815_89a8337b": {
      "original_name": "historico_2021052405 (9).pdf",
      "file_path": null,
      "summary": "Resumo:\n\nO documento é um histórico escolar emitido pela Pró-Reitoria de Ensino (PROEN) da Universidade Federal do Maranhão (UFMA), com o objetivo de registrar a evolução acadêmica de um estudante, Hissa Barbara Oliveira, matrícula 2021052405.\n\nO documento aborda os principais tópicos e seções, incluindo dados pessoais, curso e período letivo, componentes curriculares cursados e cursando, notas e situações acadêmicas. Além disso, apresenta informações sobre a matrícula, emissão e código de verificação do documento.\n\nOs dados importantes incluem a nota média geral de 7,5, aprovado em 24 componentes curriculares e reprovado em 6, com uma média de 3,5. Além disso, o documento destaca a aprovação em cursos como Ciência, Tecnologia e Sociedade, Física Experimental II, Laboratório de Programação e Engenharia de Software.\n\nEm conclusão, o histórico escolar é um documento importante para a avaliação e registro da evolução acadêmica de um estudante. Os dados apresentados fornecem informações valiosas para consultas futuras e podem ser utilizados para fins de avaliação, planejamento e tomada de decisões acadêmicas.",
      "upload_date": "2025-08-15T20:28:13.181098",
      "file_size": 33700,
      "chunks_count": 13,
      "text_length": 10129,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 3,
        "avg_chunk_size": 889,
        "min_chunk_size": 425,
        "max_chunk_size": 984
      }
    },
    "20250815_f06b4621": {
      "original_name": "Codigos_fontes.pdf",
      "file_path": null,
      "summary": "Resumo do documento \"Codigos_fontes.pdf\":\n\nO documento \"Codigos_fontes.pdf\" é um arquivo de diagrama de casos de uso (Use Case) em formato PDF, que descreve as funcionalidades e fluxos de trabalho de uma aplicação. O objetivo principal do documento é apresentar a estrutura e a lógica de funcionamento da aplicação, identificando os principais atores, casos de uso e interações entre eles.\n\nO documento é composto por cinco seções, cada uma abordando um tópico específico: Avaliar Resposta, Cadastro e Login, Gerenciar Resoluções, Histórico e Fazer Pergunta. Essas seções apresentam diagramas de casos de uso em formato UML, que descrevem as interações entre os atores (Usuário e Administrador) e os casos de uso.\n\nOs dados importantes apresentados no documento incluem a existência de casos de uso para avaliar respostas, criar contas e fazer login, gerenciar resoluções e histórico de perguntas e respostas. Além disso, o documento destaca a importância da validação de dados e credenciais, bem como a possibilidade de extensão de casos de uso para incluir novas funcionalidades.\n\nEm resumo, o documento \"Codigos_fontes.pdf\" é um importante recurso para entender a estrutura e a lógica de funcionamento da aplicação, fornecendo informações valiosas para consultas futuras e para o desenvolvimento de novas funcionalidades.",
      "upload_date": "2025-08-15T20:32:24.425482",
      "file_size": 49911,
      "chunks_count": 6,
      "text_length": 1921,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 2,
        "avg_chunk_size": 687,
        "min_chunk_size": 169,
        "max_chunk_size": 991
      }
    },
    "20250815_e3877ccb": {
      "original_name": "Codigos_fontes.pdf",
      "file_path": null,
      "summary": "Resumo:\n\nO arquivo \"Codigos_fontes.pdf\" é um documento que apresenta um modelo de análise de requisitos de sistema, utilizando a linguagem de modelagem de requisitos UML (Unified Modeling Language). O objetivo principal do documento é descrever e analisar as funcionalidades e comportamentos do sistema, identificando as principais interações entre os usuários e os componentes do sistema.\n\nAs principais seções do documento abordam as seguintes tópicos: Avaliar Resposta, Cadastro e Login, Gerenciar Resoluções, Histórico, e Fazer Pergunta. Cada seção apresenta um diagrama de uso caso (Use Case Diagram) que descreve as interações entre os usuários e os componentes do sistema, bem como as relações entre as diferentes funcionalidades.\n\nAlguns dados importantes destacados no documento incluem a presença de funcionalidades de avaliação de respostas, cadastro e login, gerenciamento de resoluções, histórico de conversas e pergunta. Além disso, o documento destaca a importância da integração com base vetorial e LLM (Large Language Model) para processar perguntas e respostas.\n\nEm resumo, o documento \"Codigos_fontes.pdf\" é uma análise de requisitos de sistema que apresenta um modelo de UML para descrever as funcionalidades e comportamentos do sistema. O documento é útil para consultas futuras, pois fornece uma visão geral das principais interações entre os usuários e os componentes do sistema, bem como a estrutura e a lógica do sistema.",
      "upload_date": "2025-08-15T20:39:23.603761",
      "file_size": 49911,
      "chunks_count": 6,
      "text_length": 1921,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 2,
        "avg_chunk_size": 687,
        "min_chunk_size": 169,
        "max_chunk_size": 991
      }
    },
    "20250816_123838dc": {
      "original_name": "Codigos_fontes.pdf",
      "file_path": null,
      "summary": "Resumo:\n\nO documento \"Codigos_fontes.pdf\" é um arquivo de diagrama de fluxo de processos (use cases) que descreve o funcionamento de um sistema de avaliação de respostas. O objetivo principal do documento é apresentar as principais funcionalidades e interações entre os usuários e o sistema.\n\nAs principais seções abordadas no documento incluem: Avaliar Resposta, Cadastro e Login, Gerenciar Resoluções, Histórico, e Fazer Pergunta. Cada seção apresenta diagramas de fluxo de processos que detalham as etapas e interações envolvidas em cada funcionalidade.\n\nAlguns dados importantes destacados no documento incluem a possibilidade de avaliar respostas de forma positiva ou negativa, a opção de login com Google, a capacidade de gerenciar resoluções e histórico de perguntas e respostas. Além disso, o documento destaca a importância da validação de dados e credenciais para garantir a segurança do sistema.\n\nEm resumo, o documento \"Codigos_fontes.pdf\" é uma ferramenta útil para entender o funcionamento de um sistema de avaliação de respostas e suas principais funcionalidades. Ele pode ser utilizado como referência para consultas futuras e para implementar melhorias no sistema.",
      "upload_date": "2025-08-16T02:57:41.222551",
      "file_size": 49911,
      "chunks_count": 6,
      "text_length": 1921,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 2,
        "avg_chunk_size": 687,
        "min_chunk_size": 169,
        "max_chunk_size": 991
      }
    },
    "20250816_c892500e": {
      "original_name": "Codigos_fontes.pdf",
      "file_path": null,
      "summary": "Resumo:\n\nO documento \"Codigos_fontes.pdf\" é um arquivo de diagramas de casos de uso (Use Cases) em formato de linguagem de modelagem de sistemas de processos (PlantUML). O objetivo principal do documento é apresentar os principais fluxos de trabalho e interações entre os usuários e os sistemas.\n\nO documento é dividido em cinco seções, cada uma abordando um tópico específico: Avaliar Resposta, Cadastro e Login, Gerenciar Resoluções, Histórico e Fazer Pergunta. Cada seção apresenta diagramas de casos de uso que descrevem as interações entre os usuários e os sistemas, bem como as relações entre as diferentes funcionalidades.\n\nOs dados importantes apresentados no documento incluem a criação de contas, login, avaliação de respostas, gerenciamento de resoluções, histórico de perguntas e respostas, e processamento de perguntas. Além disso, o documento destaca a importância da validação de dados e credenciais, bem como a necessidade de atualizar a base vetorial e consultar a Linguagem de Linguagem de Linguagem (LLM).\n\nEm conclusão, o documento \"Codigos_fontes.pdf\" é uma ferramenta útil para entender os principais fluxos de trabalho e interações entre os usuários e os sistemas. Ele destaca a importância da validação de dados e credenciais, bem como a necessidade de atualizar a base vetorial e consultar a LLM. Além disso, o documento pode ser útil para consultas futuras, permitindo que os desenvolvedores e os usuários entenda melhor como os sistemas funcionam e como podem ser melhorados.",
      "upload_date": "2025-08-16T03:22:32.701268",
      "file_size": 49911,
      "chunks_count": 6,
      "text_length": 1919,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 2,
        "avg_chunk_size": 1012,
        "min_chunk_size": 870,
        "max_chunk_size": 1160,
        "chunks_with_numbers": 6,
        "processing_optimized": true
      }
    },
    "20250816_6a097de9": {
      "original_name": "ConsultAI-Declaracao_de_Autoria_e_Titularidade.pdf",
      "file_path": null,
      "summary": "Resumo:\n\nO documento \"ConsultAI-Declaracao_de_Autoria_e_Titularidade.pdf\" é uma declaração de autoria e titularidade de um programa de computador intitulado ConsultAI, emitida pela Diretoria de Pesquisa e Inovação Tecnológica da Universidade Federal do Maranhão.\n\nO objetivo principal do documento é declarar a autoria do programa de computador e a titularidade dos direitos patrimoniais, que pertencem à Universidade Federal do Maranhão, de acordo com a Lei n° 9.209/1998.\n\nO documento aborda os seguintes tópicos: a declaração de autoria do programa de computador, a data de criação do programa (30 de junho de 2025) e a titularidade dos direitos patrimoniais. Além disso, o documento menciona a Lei n° 9.209/1998, que regula a propriedade intelectual no Brasil.\n\nOs dados importantes incluem a data de criação do programa (30 de junho de 2025) e a titularidade dos direitos patrimoniais da Universidade Federal do Maranhão. Conclusivamente, o documento é uma declaração oficial da autoria e titularidade do programa de computador ConsultAI, emitida pela Universidade Federal do Maranhão.\n\nInformações úteis para consultas futuras:\n\n* Data de criação do programa: 30 de junho de 2025\n* Titularidade dos direitos patrimoniais: Universidade Federal do Maranhão\n* Lei que regula a propriedade intelectual: Lei n° 9.209/1998\n* Entidade responsável pela emissão do documento: Diretoria de Pesquisa e Inovação Tecnológica da Universidade Federal do Maranhão",
      "upload_date": "2025-08-16T03:22:50.978829",
      "file_size": 273180,
      "chunks_count": 2,
      "text_length": 694,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 1,
        "avg_chunk_size": 681,
        "min_chunk_size": 673,
        "max_chunk_size": 690,
        "chunks_with_numbers": 2,
        "processing_optimized": true
      }
    },
    "20250816_a23b1adb": {
      "original_name": "ConsultAI-Declaracao_de_Autoria_e_Titularidade.pdf",
      "file_path": null,
      "summary": "Resumo:\n\nO documento \"ConsultAI-Declaracao_de_Autoria_e_Titularidade.pdf\" é uma declaração de autoria e titularidade de um programa de computador chamado ConsultAI, emitida pela Diretoria de Pesquisa e Inovação Tecnológica da Universidade Federal do Maranhão.\n\nO objetivo principal do documento é declarar que os autores do programa de computador ConsultAI são os signatários, que criaram o programa em 30 de junho de 2025. Além disso, a declaração afirma que os autores estão cientes de que, de acordo com a Lei n° 9.209/1998, a titularidade dos direitos patrimoniais do programa de computador pertence à Universidade Federal do Maranhão.\n\nOs principais tópicos abordados no documento são a declaração de autoria e titularidade do programa de computador ConsultAI, bem como a referência à Lei n° 9.209/1998 que regula a propriedade intelectual.\n\nOs dados importantes mencionados no documento incluem a data de criação do programa de computador (30 de junho de 2025) e a titularidade dos direitos patrimoniais do programa de computador, que pertence à Universidade Federal do Maranhão.\n\nEm conclusão, o documento é uma declaração de autoria e titularidade de um programa de computador, que destaca a importância da propriedade intelectual e a responsabilidade dos autores em relação à titularidade dos direitos patrimoniais do programa de computador.",
      "upload_date": "2025-08-16T03:23:36.362702",
      "file_size": 273180,
      "chunks_count": 2,
      "text_length": 694,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 1,
        "avg_chunk_size": 681,
        "min_chunk_size": 673,
        "max_chunk_size": 690,
        "chunks_with_numbers": 2,
        "processing_optimized": true
      }
    },
    "20250816_d025704f": {
      "original_name": "historico_2021052405 (9).pdf",
      "file_path": null,
      "summary": "Resumo:\n\nO documento é um Histórico Escolar emitido pela Universidade Federal do Maranhão (UFMA) para Hissa Barbara Oliveira, com matrícula 2021052405. O objetivo principal é fornecer informações sobre o histórico acadêmico da estudante, incluindo os componentes curriculares cursados, notas e situações.\n\nO documento é composto por três páginas e aborda os seguintes tópicos: dados pessoais, histórico acadêmico, componentes curriculares cursados e pendentes, e observações. Os principais tópicos abordados incluem a descrição dos componentes curriculares, as notas obtidas e as situações das disciplinas, bem como a verificação de autenticidade e consistência do documento.\n\nOs dados importantes incluem a matrícula da estudante, a data de emissão do documento e o código de verificação. Além disso, o documento destaca que a estudante cumpriu alguns componentes curriculares através de equivalências, o que é mencionado na seção de observações.\n\nEm resumo, o documento é um histórico acadêmico detalhado que fornece informações importantes sobre a trajetória acadêmica da estudante, incluindo os componentes curriculares cursados, notas e situações. O documento também destaca a verificação de autenticidade e consistência, tornando-o uma ferramenta útil para consultas futuras.",
      "upload_date": "2025-08-16T03:25:17.525438",
      "file_size": 33700,
      "chunks_count": 12,
      "text_length": 10115,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 3,
        "avg_chunk_size": 978,
        "min_chunk_size": 450,
        "max_chunk_size": 1191,
        "chunks_with_numbers": 12,
        "processing_optimized": true
      }
    },
    "20250816_510f10ae": {
      "original_name": "historico_2021052405 (10).pdf",
      "file_path": null,
      "summary": "Resumo:\n\nO documento é um Histórico Escolar, emitido em 16/08/2025, que apresenta a trajetória acadêmica de Hissa Barbara Oliveira, estudante da Universidade Federal do Maranhão (UFMA). O objetivo principal do documento é fornecer uma visão geral da evolução acadêmica do estudante, incluindo os componentes curriculares cursados, as notas obtidas e as situações em que o estudante se encontra.\n\nO documento é composto por três páginas e aborda vários tópicos, incluindo a apresentação dos dados pessoais do estudante, a lista de componentes curriculares cursados e a situação em que se encontra em relação a cada um deles. As seções mais importantes incluem a lista de componentes curriculares cursados, a situação em que se encontra em relação a cada um deles e as observações finais.\n\nOs dados importantes incluem a lista de componentes curriculares cursados, a situação em que se encontra em relação a cada um deles e as notas obtidas. Além disso, o documento destaca que o estudante tem 3 componentes curriculares pendentes e que ele cumpriu dois componentes curriculares equivalentes. Outro ponto importante é que o estudante tem uma verificação automática de autenticidade e consistência do histórico, tornando dispensável a assinatura da coordenação do curso ou DIOAC.\n\nEm resumo, o documento é um histórico escolar que apresenta a trajetória acadêmica de Hissa Barbara Oliveira, estudante da UFMA. Ele aborda vários tópicos importantes, incluindo a lista de componentes curriculares cursados, a situação em que se encontra em relação a cada um deles e as notas obtidas. Os dados importantes incluem a lista de componentes curriculares pendentes e a verificação automática de autenticidade e consistência do histórico.",
      "upload_date": "2025-08-16T03:52:27.982674",
      "file_size": 33678,
      "chunks_count": 45,
      "text_length": 10196,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 3,
        "avg_chunk_size": 271,
        "min_chunk_size": 100,
        "max_chunk_size": 755,
        "chunks_with_numbers": 45,
        "processing_contextual": true
      }
    },
    "20250816_a7dbaed5": {
      "original_name": "historico_2021052405 (10).pdf",
      "file_path": null,
      "summary": "Resumo:\n\nO documento é um histórico escolar emitido pela Pró-Reitoria de Ensino (PROEN) da Universidade Federal do Maranhão (UFMA), com o objetivo de registrar a evolução acadêmica de Hissa Barbara Oliveira, estudante de Ciência e Tecnologia.\n\nO documento aborda os principais componentes curriculares cursados e cursando pela estudante, incluindo disciplinas como Química Geral e Inorgânica, Física Experimental, Mecânica dos Sólidos, Laboratório de Programação e Engenharia de Software. Além disso, o documento apresenta as notas e situações acadêmicas da estudante em cada componente curricular.\n\nOs dados importantes incluem a matrícula da estudante (2021052405), a data de emissão do documento (16/08/2025 às 03:31h) e o código de verificação (bb0aec99ab). Além disso, o documento destaca que a estudante utilizou bonificação e que o prazo máximo para conclusão do curso é 2026.1.\n\nConclusões:\n\nO documento histórico escolar é uma ferramenta importante para a avaliação da evolução acadêmica de Hissa Barbara Oliveira. Os dados apresentados permitem uma visão geral da trajetória acadêmica da estudante, incluindo as disciplinas cursadas, as notas obtidas e as situações acadêmicas. Além disso, o documento destaca a importância da utilização de bonificação e do prazo máximo para conclusão do curso.",
      "upload_date": "2025-08-16T04:28:10.844374",
      "file_size": 33678,
      "chunks_count": 13,
      "text_length": 10134,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 3,
        "avg_chunk_size": 889,
        "min_chunk_size": 425,
        "max_chunk_size": 984
      }
    },
    "20250816_76c560d0": {
      "original_name": "historico_2021052405 (9).pdf",
      "file_path": null,
      "summary": "Resumo:\n\nO documento é um histórico escolar emitido pela Pró-Reitoria de Ensino (PROEN) da Universidade Federal do Maranhão (UFMA), com o objetivo de registrar a trajetória acadêmica de Hissa Barbara Oliveira, aluno do curso de Ciência e Tecnologia - Bacharelado em Ciência e Tecnologia.\n\nO documento aborda os principais componentes curriculares cursados e cursando, incluindo disciplinas como Química Geral e Inorgânica, Física Experimental, Mecânica dos Sólidos, Engenharia de Software e outros. Além disso, o documento apresenta as notas e situações acadêmicas dos componentes curriculares, bem como as datas de início e fim do curso.\n\nOs dados importantes incluem a matrícula do aluno (2021052405), a data de emissão do documento (13/08/2025) e o código de verificação (b9d832bd11). Além disso, o documento destaca a aprovação do aluno em várias disciplinas, com notas médias acima de 7,0, e a situação acadêmica do aluno como \"ativo\" no curso.\n\nEm resumo, o documento é um histórico escolar que registra a trajetória acadêmica de Hissa Barbara Oliveira, aluno do curso de Ciência e Tecnologia - Bacharelado em Ciência e Tecnologia da Universidade Federal do Maranhão. O documento apresenta os principais componentes curriculares cursados e cursando, notas e situações acadêmicas, e é importante para consultas futuras.",
      "upload_date": "2025-08-16T04:30:42.353345",
      "file_size": 33700,
      "chunks_count": 13,
      "text_length": 10132,
      "file_removed": true,
      "processing_stats": {
        "pages_processed": 3,
        "avg_chunk_size": 889,
        "min_chunk_size": 425,
        "max_chunk_size": 984
      }
    }
  }
}